import React from "react";
import styled from 'styled-components'
import Arthur from '../media/King_Arthur.jpg';



const Title = styled.h2`
font-size: 1.5em;
text-align: center;
color: rgb(96, 35, 146);`;

const Photo = styled.div`
display: flex;
justify-content: center;
align-items: center;
margin-bottom:20px;`;

const Text = styled.div`
margin-left:80px;
margin-right:80px;
text-align: justify;
font-size:21px;
`;

const MainPage = () => {
    return(
        <div> 
        <Title> КОРОЛЬ АРТУР І ЛИЦАРІ КРУГЛОГО СТОЛУ</Title>
        <Photo><img src={Arthur} alt="king" /></Photo>
        <Text>Якщо коротко, легенда про короля Артура така. Артур, первісток короля Утера Пендрагона, був народжений в Британії в важкі неспокійні часи. Мудрий чарівник Мерлін порадив заховати новонародженого, щоб ніхто не знав про його справжнє походження. Після смерті Утера Пендрагона Британія залишилася без короля, і тоді Мерлін за допомогою магії створив меч і встромив його в камінь. На зброю золотом було написано: «Той, хто зможе витягти меч з каменю, буде правонаступником короля Британії».

Багато робили спроби це зробити, але тільки Артур зміг витягнути меч, і Мерлін його коронував. Коли в битві з королем Пеллінора Артур зламав свій меч, Мерлін відвів його до озера, з вод якого здалася чарівна рука з знаменитим Екскалібур. З цим мечем (який дала йому Володарка озера) Артур був непереможний в битвах.

Одружившись на Гвиневре, батько якої (в деяких версіях перекази) подарував йому круглий стіл, Артур зібрав найбільших лицарів тих часів і влаштувався в замку Камелота. Лицарі Круглого столу, як їх почали називати, захищали жителів Британії від драконів, велетнів і чорних лицарів, а також займалися пошуком скарбів, зокрема чаші, з якої пив Христос під час Таємної вечері, легендарний святий Грааль. Артур брав участь у багатьох кровопролитних боях проти саксів. Під його проводом британці здобули найбільшу перемогу на горі Бадон, після якої врешті-решт було зупинено наступ саксів.

Але вдома короля Артура чекало неприємне звістка. Доблесний лицар Ланселот закохався в його дружину Гвиневру. Незабаром про цю інтрижку дізналися, і Гвиневру засудили до смерті, а Ланселота вигнали. Але Ланселот повернувся, щоб врятувати королеву, і відвіз її в свій замок до Франції. Артур з вірними воїнами кинувся на пошуки Ланселота. А тим часом Мордред (син Артура від його зведеної сестри Моргани - відьми, з якою у нього був зв'язок в юності, коли він не знав, хто вона насправді) захотів захопити владу в Британії.

Коли Артур повернувся, батько з сином зійшлися в битві при камлання. Артур убив Мордреда, але і сам отримав смертельну рану. Його поклали в човен і пустили вниз по річці. Тура пристала до острова Авалон, де його рани залікували три дивовижні королеви в чорному одязі. Невдовзі після того як рознеслася звістка про смерть короля Артура. Ланселот і Гвиневра померли від горя. Але тіло Артура так і не було знайдено. Кажуть, що він дрімає десь під пагорбом, чекаючи свого часу, коли знову потрібно буде збирати своїх лицарів для порятунку Британії.</Text>
        </div> )
};

export default MainPage;